docs/todo.md

# Table of Contents

1.  [Auto Updater](#org1d7390c)
    1.  [hack together something with electron-builder](#org19eb271)
    2.  [differential updates](#org91836a9)
    3.  [electron-forge migration](#orge89a574)
        1.  [electron forge vite support](#org6da29e2)
2.  [UI](#orge4699c3)
    1.  [Blockly Integration](#org26e8918)
    2.  [UX flow](#orgb2a9199)
3.  [Plugins](#org3fd3742)
    1.  [First Steps](#org4f33edc)
    2.  [Example Plugins](#org66cf775)
4.  [Cue Mapping system](#orgf844e7b)
    1.  [Cue - signal data structure](#org157214c)
    2.  [Cue operations refactor for data structure](#orgd5d23ee)
    3.  [Save and Load cue maps](#org8f3dffd)



<a id="org1d7390c"></a>

# TODO Auto Updater

Plan to follow <https://www.electronjs.org/docs/latest/tutorial/updates>


<a id="org19eb271"></a>

## TODO hack together something with electron-builder

use autoupdater module to look for + extract + install new updates from github releases


<a id="org91836a9"></a>

## HOLD differential updates

probably more of a &rsquo;nice to have&rsquo;


<a id="orge89a574"></a>

## WAIT electron-forge migration

forge is better supported than builder, less confusing build path and documentation

HOWEVER&#x2026;


<a id="org6da29e2"></a>

### WAIT electron forge vite support

waiting on <https://github.com/electron/forge/pull/3071>


<a id="orge4699c3"></a>

# TODO UI

Create an editor based on [Blockly](https://developers.google.com/blockly/guides/get-started/web) to represent imported functions from plugins.


<a id="org26e8918"></a>

## TODO Blockly Integration

[3](#org3fd3742)


<a id="orgb2a9199"></a>

## TODO UX flow


<a id="org3fd3742"></a>

# TODO Plugins

Finalise the plugin developer workflow


<a id="org4f33edc"></a>

## TODO First Steps

Project setup - npm, required tooling, etc.


<a id="org66cf775"></a>

## TODO Example Plugins

Heavily commented code


<a id="orgf844e7b"></a>

# TODO Cue Mapping system


<a id="org157214c"></a>

## TODO Cue - signal data structure


<a id="orgd5d23ee"></a>

## TODO Cue operations refactor for data structure

i.e. attaching cues, creating cues, etc.


<a id="org8f3dffd"></a>

## TODO Save and Load cue maps

